app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

INSERT INTO `articles` (`updated_at`, `title`, `article_type`, `description`, `created_at`) VALUES('2010-03-24 07:04:12', '11', 'product', '22', '2010-03-24 07:04:12')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `article_type` = 'first', `description` = '<p>the smart bupt is a very good project.\r\n you can learn many from it. that is all.</p>', `updated_at` = '2010-03-24 04:54:34' WHERE `id` = 1
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM `articles` WHERE (article_type= 'first_type')
---
  def show_articles_by_type
    article_type=params[:article_type]
    @articles = Article.find(:all,
                            :conditions=>["article_type= ?",article_type])

SELECT * FROM `articles` WHERE (avg_mark >= 80) ORDER BY avg_mark DESC LIMIT 10
---
  def show_introduces
    @intro = Article.find(:all,
                         :conditions => "avg_mark >= 80",
                         :order => "avg_mark DESC",
                         :limit => 10)

SELECT * FROM `articles` WHERE (`articles`.`id` = 4)
---
  def mark
    mark = params[:mark]
    id = params[:id]
    @response_xml = {:id => id,:mark => mark.to_f,:result => "failed"}
    @response_xml[:reason] = "mark incorrect"
    if mark.to_f >= 0 and mark.to_f <=100
      article = Article.find(id)